// ============================================================================
// myungdal tech-demo project
// 
// Author: 안명달 (Myungdal Ahn)
// Email: mooondal@gmail.com
// GitHub: https://github.com/myungdal/tech_demo.git
// ============================================================================

#pragma once

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// GuildCacheAccessor
// 길드 캐시 데이터에 대한 접근자 클래스입니다.
// (현재 미구현 상태)
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

class GuildCacheAccessor
{
private:
//	PacketKeep<GUILD> mGuild;
};
